#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_lb.backend will be created
  + resource "azurerm_lb" "backend" {
      + id                   = (known after apply)
      + location             = "northeurope"
      + name                 = "backend-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "devops-training-team1"
      + sku                  = "Basic"

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "backendIPAddress"
          + outbound_rules                = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_lb.database will be created
  + resource "azurerm_lb" "database" {
      + id                   = (known after apply)
      + location             = "northeurope"
      + name                 = "database-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "devops-training-team1"
      + sku                  = "Basic"

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "databaseIPAddress"
          + outbound_rules                = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_lb.frontend will be created
  + resource "azurerm_lb" "frontend" {
      + id                   = (known after apply)
      + location             = "northeurope"
      + name                 = "frontend-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "devops-training-team1"
      + sku                  = "Basic"

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "frontendIPAddress"
          + outbound_rules                = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "team1-nsg"
      + resource_group_name = "devops-training-team1"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "sshrule"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_network_security_rule.frontendhttp will be created
  + resource "azurerm_network_security_rule" "frontendhttp" {
      + access                      = "Allow"
      + destination_address_prefix  = (known after apply)
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Port_Internet_80"
      + network_security_group_name = "team1-nsg"
      + priority                    = 330
      + protocol                    = "Tcp"
      + resource_group_name         = "devops-training-team1"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "lbpip"
      + resource_group_name     = "devops-training-team1"
      + sku                     = "Basic"
    }

  # azurerm_subnet.backend will be created
  + resource "azurerm_subnet" "backend" {
      + address_prefix                                 = "10.0.2.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "backend"
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "team1-vnet"
    }

  # azurerm_subnet.database will be created
  + resource "azurerm_subnet" "database" {
      + address_prefix                                 = "10.0.3.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "database"
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "team1-vnet"
    }

  # azurerm_subnet.frontend will be created
  + resource "azurerm_subnet" "frontend" {
      + address_prefix                                 = "10.0.1.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "frontend"
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "team1-vnet"
    }

  # azurerm_subnet_network_security_group_association.backend will be created
  + resource "azurerm_subnet_network_security_group_association" "backend" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.database will be created
  + resource "azurerm_subnet_network_security_group_association" "database" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.frontend will be created
  + resource "azurerm_subnet_network_security_group_association" "frontend" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "team1-vnet"
      + resource_group_name = "devops-training-team1"

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # module.backend.azurerm_lb_backend_address_pool.bpepool will be created
  + resource "azurerm_lb_backend_address_pool" "bpepool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "backendBackEndAddressPool"
      + resource_group_name       = "devops-training-team1"
    }

  # module.backend.azurerm_lb_nat_pool.natpool will be created
  + resource "azurerm_lb_nat_pool" "natpool" {
      + backend_port                   = 22
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "backendIPAddress"
      + frontend_port_end              = 50119
      + frontend_port_start            = 50000
      + id                             = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "ssh"
      + protocol                       = "tcp"
      + resource_group_name            = "devops-training-team1"
    }

  # module.backend.azurerm_lb_probe.probe will be created
  + resource "azurerm_lb_probe" "probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http-running-probe"
      + number_of_probes    = 2
      + port                = 80
      + protocol            = (known after apply)
      + resource_group_name = "devops-training-team1"
    }

  # module.backend.azurerm_lb_rule.lbnatrule will be created
  + resource "azurerm_lb_rule" "lbnatrule" {
      + backend_address_pool_id        = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "backendIPAddress"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "http"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "devops-training-team1"
    }

  # module.backend.azurerm_virtual_machine_scale_set.vmss will be created
  + resource "azurerm_virtual_machine_scale_set" "vmss" {
      + automatic_os_upgrade   = false
      + id                     = (known after apply)
      + license_type           = (known after apply)
      + location               = "northeurope"
      + name                   = "backend-scaleset"
      + overprovision          = true
      + resource_group_name    = "devops-training-team1"
      + single_placement_group = true
      + upgrade_policy_mode    = "Manual"

      + extension {
          + name                       = "example"
          + protected_settings         = (sensitive value)
          + provision_after_extensions = []
          + publisher                  = "Microsoft.Azure.Extensions"
          + type                       = "CustomScript"
          + type_handler_version       = "2.0"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + network_profile {
          + ip_forwarding = false
          + name          = "publicNetworkProfile"
          + primary       = true

          + ip_configuration {
              + application_gateway_backend_address_pool_ids = []
              + application_security_group_ids               = []
              + load_balancer_backend_address_pool_ids       = (known after apply)
              + load_balancer_inbound_nat_rules_ids          = (known after apply)
              + name                                         = "backendIPConfiguration"
              + primary                                      = true
              + subnet_id                                    = (known after apply)
            }
        }

      + os_profile {
          + admin_username       = "testadmin"
          + computer_name_prefix = "backend"
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDDOphCHThzsgraK4np2AtNZiQeru2l1gNMyqeSg9K/elaW7kWGqtcsRR3vP1zQDZbWfhhfyqARn9DEZLQFhsAt59CCc1sokmFnWUaHcANS4+3B0fbIFuBJ/i7SgKjkFRXpFoQ7NFzp9uzJ4QQ/R1+qSO80VSPYLz7sciypLphTNXScd3L/gqEBN72Rmbf5Xq5pa1HU4AzEnYd8lc/y9TlCeSs62LoXz+FzRPd8+CzIKtY/T6FAS1fh/E+haVkb8ghkBQ4NIbh7WXCgIUPu/PeM/XTQZ+N6WWI0kuSWdszYzIcVEuflWAwxg8+YXwHn0zX45uF+jRTQX2uy49DH4epeFYbHPQ8ESF/wUdd+M7ZBJQKd/FcVw/otxhK0e7B81TDgVx/Up0I+mgRCHQ45tTcHQ1aSZuLjLov5A6D7EIKdChGSxuWZI6CgQYZt39scOnZbNU0i2Qu2oNOQ8vSCABJ3jTFJUfaF0RN3eICRnwuBogXrpeBYxQm2nP1E9zkjyeSN6uaDPPNJAhztOvz2eHbMRAZjmNvy3EHs2LIntcy3hTgzBM0AzDrtnEwAPkVngPhpB1kX6kJlFZ/Qs+9X9lhQbH32rMB7NOUlJirIvoBTgA/R4LzPR5djI1+S7b1YPLBtqOhgmG9lZcbM4OwjV1mRPRtUuxYS5sWX2RESU156XQ== Generated by E217974@PC38695."
              + path     = "/home/testadmin/.ssh/authorized_keys"
            }
        }

      + sku {
          + capacity = 3
          + name     = "Standard_B1ms"
          + tier     = "Standard"
        }

      + storage_profile_data_disk {
          + caching           = "ReadWrite"
          + create_option     = "Empty"
          + disk_size_gb      = 10
          + lun               = 0
          + managed_disk_type = (known after apply)
        }

      + storage_profile_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_profile_os_disk {
          + caching           = "ReadWrite"
          + create_option     = "FromImage"
          + managed_disk_type = "Standard_LRS"
          + vhd_containers    = []
        }
    }

  # module.database.azurerm_lb_backend_address_pool.bpepool will be created
  + resource "azurerm_lb_backend_address_pool" "bpepool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "databaseBackEndAddressPool"
      + resource_group_name       = "devops-training-team1"
    }

  # module.database.azurerm_lb_nat_pool.natpool will be created
  + resource "azurerm_lb_nat_pool" "natpool" {
      + backend_port                   = 22
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "databaseIPAddress"
      + frontend_port_end              = 50119
      + frontend_port_start            = 50000
      + id                             = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "ssh"
      + protocol                       = "tcp"
      + resource_group_name            = "devops-training-team1"
    }

  # module.database.azurerm_lb_probe.probe will be created
  + resource "azurerm_lb_probe" "probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http-running-probe"
      + number_of_probes    = 2
      + port                = 5432
      + protocol            = (known after apply)
      + resource_group_name = "devops-training-team1"
    }

  # module.database.azurerm_lb_rule.lbnatrule will be created
  + resource "azurerm_lb_rule" "lbnatrule" {
      + backend_address_pool_id        = (known after apply)
      + backend_port                   = 5432
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "databaseIPAddress"
      + frontend_port                  = 5432
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "http"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "devops-training-team1"
    }

  # module.database.azurerm_virtual_machine_scale_set.vmss will be created
  + resource "azurerm_virtual_machine_scale_set" "vmss" {
      + automatic_os_upgrade   = false
      + id                     = (known after apply)
      + license_type           = (known after apply)
      + location               = "northeurope"
      + name                   = "database-scaleset"
      + overprovision          = true
      + resource_group_name    = "devops-training-team1"
      + single_placement_group = true
      + upgrade_policy_mode    = "Manual"

      + extension {
          + name                       = "example"
          + protected_settings         = (sensitive value)
          + provision_after_extensions = []
          + publisher                  = "Microsoft.Azure.Extensions"
          + type                       = "CustomScript"
          + type_handler_version       = "2.0"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + network_profile {
          + ip_forwarding = false
          + name          = "publicNetworkProfile"
          + primary       = true

          + ip_configuration {
              + application_gateway_backend_address_pool_ids = []
              + application_security_group_ids               = []
              + load_balancer_backend_address_pool_ids       = (known after apply)
              + load_balancer_inbound_nat_rules_ids          = (known after apply)
              + name                                         = "databaseIPConfiguration"
              + primary                                      = true
              + subnet_id                                    = (known after apply)
            }
        }

      + os_profile {
          + admin_username       = "testadmin"
          + computer_name_prefix = "database"
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDDOphCHThzsgraK4np2AtNZiQeru2l1gNMyqeSg9K/elaW7kWGqtcsRR3vP1zQDZbWfhhfyqARn9DEZLQFhsAt59CCc1sokmFnWUaHcANS4+3B0fbIFuBJ/i7SgKjkFRXpFoQ7NFzp9uzJ4QQ/R1+qSO80VSPYLz7sciypLphTNXScd3L/gqEBN72Rmbf5Xq5pa1HU4AzEnYd8lc/y9TlCeSs62LoXz+FzRPd8+CzIKtY/T6FAS1fh/E+haVkb8ghkBQ4NIbh7WXCgIUPu/PeM/XTQZ+N6WWI0kuSWdszYzIcVEuflWAwxg8+YXwHn0zX45uF+jRTQX2uy49DH4epeFYbHPQ8ESF/wUdd+M7ZBJQKd/FcVw/otxhK0e7B81TDgVx/Up0I+mgRCHQ45tTcHQ1aSZuLjLov5A6D7EIKdChGSxuWZI6CgQYZt39scOnZbNU0i2Qu2oNOQ8vSCABJ3jTFJUfaF0RN3eICRnwuBogXrpeBYxQm2nP1E9zkjyeSN6uaDPPNJAhztOvz2eHbMRAZjmNvy3EHs2LIntcy3hTgzBM0AzDrtnEwAPkVngPhpB1kX6kJlFZ/Qs+9X9lhQbH32rMB7NOUlJirIvoBTgA/R4LzPR5djI1+S7b1YPLBtqOhgmG9lZcbM4OwjV1mRPRtUuxYS5sWX2RESU156XQ== Generated by E217974@PC38695."
              + path     = "/home/testadmin/.ssh/authorized_keys"
            }
        }

      + sku {
          + capacity = 3
          + name     = "Standard_B1ms"
          + tier     = "Standard"
        }

      + storage_profile_data_disk {
          + caching           = "ReadWrite"
          + create_option     = "Empty"
          + disk_size_gb      = 10
          + lun               = 0
          + managed_disk_type = (known after apply)
        }

      + storage_profile_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_profile_os_disk {
          + caching           = "ReadWrite"
          + create_option     = "FromImage"
          + managed_disk_type = "Standard_LRS"
          + vhd_containers    = []
        }
    }

  # module.frontend.azurerm_lb_backend_address_pool.bpepool will be created
  + resource "azurerm_lb_backend_address_pool" "bpepool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "frontendBackEndAddressPool"
      + resource_group_name       = "devops-training-team1"
    }

  # module.frontend.azurerm_lb_nat_pool.natpool will be created
  + resource "azurerm_lb_nat_pool" "natpool" {
      + backend_port                   = 22
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "frontendIPAddress"
      + frontend_port_end              = 50119
      + frontend_port_start            = 50000
      + id                             = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "ssh"
      + protocol                       = "tcp"
      + resource_group_name            = "devops-training-team1"
    }

  # module.frontend.azurerm_lb_probe.probe will be created
  + resource "azurerm_lb_probe" "probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http-running-probe"
      + number_of_probes    = 2
      + port                = 80
      + protocol            = (known after apply)
      + resource_group_name = "devops-training-team1"
    }

  # module.frontend.azurerm_lb_rule.lbnatrule will be created
  + resource "azurerm_lb_rule" "lbnatrule" {
      + backend_address_pool_id        = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "frontendIPAddress"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "http"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "devops-training-team1"
    }

  # module.frontend.azurerm_virtual_machine_scale_set.vmss will be created
  + resource "azurerm_virtual_machine_scale_set" "vmss" {
      + automatic_os_upgrade   = false
      + id                     = (known after apply)
      + license_type           = (known after apply)
      + location               = "northeurope"
      + name                   = "frontend-scaleset"
      + overprovision          = true
      + resource_group_name    = "devops-training-team1"
      + single_placement_group = true
      + upgrade_policy_mode    = "Manual"

      + extension {
          + name                       = "example"
          + protected_settings         = (sensitive value)
          + provision_after_extensions = []
          + publisher                  = "Microsoft.Azure.Extensions"
          + type                       = "CustomScript"
          + type_handler_version       = "2.0"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + network_profile {
          + ip_forwarding = false
          + name          = "publicNetworkProfile"
          + primary       = true

          + ip_configuration {
              + application_gateway_backend_address_pool_ids = []
              + application_security_group_ids               = []
              + load_balancer_backend_address_pool_ids       = (known after apply)
              + load_balancer_inbound_nat_rules_ids          = (known after apply)
              + name                                         = "frontendIPConfiguration"
              + primary                                      = true
              + subnet_id                                    = (known after apply)
            }
        }

      + os_profile {
          + admin_username       = "testadmin"
          + computer_name_prefix = "frontend"
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDDOphCHThzsgraK4np2AtNZiQeru2l1gNMyqeSg9K/elaW7kWGqtcsRR3vP1zQDZbWfhhfyqARn9DEZLQFhsAt59CCc1sokmFnWUaHcANS4+3B0fbIFuBJ/i7SgKjkFRXpFoQ7NFzp9uzJ4QQ/R1+qSO80VSPYLz7sciypLphTNXScd3L/gqEBN72Rmbf5Xq5pa1HU4AzEnYd8lc/y9TlCeSs62LoXz+FzRPd8+CzIKtY/T6FAS1fh/E+haVkb8ghkBQ4NIbh7WXCgIUPu/PeM/XTQZ+N6WWI0kuSWdszYzIcVEuflWAwxg8+YXwHn0zX45uF+jRTQX2uy49DH4epeFYbHPQ8ESF/wUdd+M7ZBJQKd/FcVw/otxhK0e7B81TDgVx/Up0I+mgRCHQ45tTcHQ1aSZuLjLov5A6D7EIKdChGSxuWZI6CgQYZt39scOnZbNU0i2Qu2oNOQ8vSCABJ3jTFJUfaF0RN3eICRnwuBogXrpeBYxQm2nP1E9zkjyeSN6uaDPPNJAhztOvz2eHbMRAZjmNvy3EHs2LIntcy3hTgzBM0AzDrtnEwAPkVngPhpB1kX6kJlFZ/Qs+9X9lhQbH32rMB7NOUlJirIvoBTgA/R4LzPR5djI1+S7b1YPLBtqOhgmG9lZcbM4OwjV1mRPRtUuxYS5sWX2RESU156XQ== Generated by E217974@PC38695."
              + path     = "/home/testadmin/.ssh/authorized_keys"
            }
        }

      + sku {
          + capacity = 3
          + name     = "Standard_B1ms"
          + tier     = "Standard"
        }

      + storage_profile_data_disk {
          + caching           = "ReadWrite"
          + create_option     = "Empty"
          + disk_size_gb      = 10
          + lun               = 0
          + managed_disk_type = (known after apply)
        }

      + storage_profile_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_profile_os_disk {
          + caching           = "ReadWrite"
          + create_option     = "FromImage"
          + managed_disk_type = "Standard_LRS"
          + vhd_containers    = []
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave1`, Workspace: `default`*
